bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#include <WiFiUdp.h>
#include <Arduino_SNMP_Manager.h>

// MeshCore layered protocol implementation
#include "MeshCore.hpp"

#include "config.hpp"

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

bool isMeshCoreConfigured() {
  return strlen(BLE_PEER_NAME) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);
void sendMeshCoreNotification(const String& title, const String& message);
void initMeshCore();
void disconnectMeshCore();
void disconnectWiFi();
void reconnectWiFi();

AsyncWebServer server(80);

// MeshCore Protocol Stack (layered architecture)
// Layer 1: BLE Transport - handles BLE connection and I/O
// Layer 2: Frame Codec - handles frame parsing/building  
// Layer 3: Companion Protocol - handles MeshCore protocol logic
static BLECentralTransport* meshTransport = nullptr;
static FrameCodec* meshCodec = nullptr;
static CompanionProtocol* meshProtocol = nullptr;

// BLE/WiFi coexistence - ESP32-S3 cannot run WiFi and BLE simultaneously
bool bleOperationInProgress = false;
bool monitoringPaused = false;

// Pending MeshCore notification - used to defer BLE operations from HTTP handlers
// This prevents task watchdog timeouts by allowing the async web server to complete
// HTTP response delivery before WiFi is disconnected for BLE operations.
volatile bool pendingMeshNotification = false;
String pendingMeshTitle = "";
String pendingMeshMessage = "";

// Helper functions to access protocol state (for API compatibility)
bool isMeshDeviceConnected() {
  return meshTransport != nullptr && meshTransport->isConnected();
}

bool isMeshChannelReady() {
  return meshProtocol != nullptr && meshProtocol->isChannelReady();
}

String getMeshLastError() {
  if (meshProtocol != nullptr) {
    return meshProtocol->getLastError();
  }
  if (meshTransport != nullptr) {
    return meshTransport->getLastError();
  }
  return "";
}

int getMeshProtocolState() {
  if (meshProtocol != nullptr) {
    return static_cast<int>(meshProtocol->getState());
  }
  return 0;
}

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HTTP_GET,
  TYPE_PING,
  TYPE_SNMP_GET
};

// SNMP comparison operators for value checks
enum SnmpCompareOp {
  SNMP_OP_EQ,    // Equal (=)
  SNMP_OP_NE,    // Not equal (<>)
  SNMP_OP_LT,    // Less than (<)
  SNMP_OP_LE,    // Less than or equal (<=)
  SNMP_OP_GT,    // Greater than (>)
  SNMP_OP_GE     // Greater than or equal (>=)
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int rearmCount;         // Number of failed checks before re-alerting (0 = disabled)
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  int failedChecksSinceAlert; // Failed checks since last alert (for re-arm)
  bool isUp;
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
  // SNMP-specific fields
  String snmpOid;         // SNMP OID to query (e.g., "1.3.6.1.2.1.1.1.0")
  String snmpCommunity;   // SNMP community string (default: "public")
  SnmpCompareOp snmpCompareOp;  // Comparison operator for SNMP value check
  String snmpExpectedValue;     // Expected value for comparison
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// Notification queue for failed notifications
// Only stores the latest notification per service (isUp state)
// Tracks which notification channels have failed
struct QueuedNotification {
  String serviceId;      // Service ID this notification is for
  String title;          // Notification title
  String message;        // Notification message
  bool isUp;             // true = online notification, false = offline notification
  String tags;           // ntfy tags (for ntfy notifications)
  bool ntfyPending;      // Needs to be sent via ntfy
  bool discordPending;   // Needs to be sent via Discord
  bool smtpPending;      // Needs to be sent via SMTP
  bool meshPending;      // Needs to be sent via MeshCore
  unsigned long lastRetry; // Last retry attempt timestamp
};

const int MAX_QUEUED_NOTIFICATIONS = MAX_SERVICES;
QueuedNotification notificationQueue[MAX_QUEUED_NOTIFICATIONS];
int queuedNotificationCount = 0;

// Retry interval for failed notifications (30 seconds for WiFi-based)
const unsigned long NOTIFICATION_RETRY_INTERVAL = 30000;

// MeshCore retry interval (10 minutes to prevent frequent WiFi disconnects)
const unsigned long MESHCORE_RETRY_INTERVAL = 600000;
unsigned long lastMeshCoreRetry = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
bool ensureAuthenticated(AsyncWebServerRequest* request);
void loadServices();
void saveServices();
String generateServiceId();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
bool checkSnmpGet(Service& service);
String getWebPage();
String getServiceTypeString(ServiceType type);
String getSnmpCompareOpString(SnmpCompareOp op);
SnmpCompareOp parseSnmpCompareOp(const String& opStr);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);
void sendBootNotification();

// Notification sending functions that return success status
bool sendNtfyNotificationWithStatus(const String& title, const String& message, const String& tags);
bool sendDiscordNotificationWithStatus(const String& title, const String& message);
bool sendSmtpNotificationWithStatus(const String& title, const String& message);
bool sendMeshCoreNotificationWithStatus(const String& title, const String& message);

// Notification queue functions
void queueNotification(const String& serviceId, const String& title, const String& message, 
                       bool isUp, const String& tags, bool ntfyFailed, bool discordFailed, 
                       bool smtpFailed, bool meshFailed);
void processNotificationQueue();
void processMeshCoreQueue();
int findQueuedNotification(const String& serviceId);
void removeQueuedNotification(int index);

void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("Starting ESP32 Uptime Monitor...");

