bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Initialize filesystem
  initFileSystem();

  // Initialize WiFi
  initWiFi();

  // Load saved services
  loadServices();

  // Initialize web server
  initWebServer();

  // Send boot notification if enabled and WiFi is connected
  if (BOOT_NOTIFICATION_ENABLED) {
    if (WiFi.status() == WL_CONNECTED) {
      sendBootNotification();
    } else {
      Serial.println("Boot notification skipped: WiFi not connected");
    }
  }

  Serial.println("System ready!");
  Serial.print("Access web interface at: http://");
  Serial.println(WiFi.localIP());
}

void loop() {
  static unsigned long lastCheckTime = 0;
  unsigned long currentTime = millis();

  // Process pending MeshCore notifications from HTTP handlers
  // This runs in the main loop to avoid blocking the async web server
  // and prevents task watchdog timeouts from WiFi/BLE switching during HTTP responses
  if (pendingMeshNotification && !bleOperationInProgress) {
    // Copy values and clear flag atomically to prevent race conditions with HTTP handler.
    // The HTTP handler checks both pendingMeshNotification and bleOperationInProgress
    // before writing, so setting the flag false first prevents new writes.
    // We use noInterrupts()/interrupts() to ensure the copy is atomic since
    // the async web server runs in a separate FreeRTOS task.
    noInterrupts();
    pendingMeshNotification = false;
    String title = pendingMeshTitle;
    String message = pendingMeshMessage;
    pendingMeshTitle = "";
    pendingMeshMessage = "";
    interrupts();
    
    sendMeshCoreNotification(title, message);
  }

  // Skip service checks if monitoring is paused (e.g., during BLE operations)
  if (monitoringPaused) {
    delay(10);
    return;
  }

  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
  }

  // Process notification queue for failed notifications (WiFi-based)
  processNotificationQueue();
  
  // Process MeshCore queue separately (batched, 10 minute interval)
  processMeshCoreQueue();

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to connect to WiFi!");
  }
}

void initMeshCore() {
  Serial.println("Initializing MeshCore protocol stack...");
  Serial.printf("Free heap before init: %d bytes\n", ESP.getFreeHeap());
  
  // Create the layered protocol stack
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  meshTransport = new BLECentralTransport(config);
  meshCodec = new FrameCodec(*meshTransport);
  meshProtocol = new CompanionProtocol(*meshTransport, *meshCodec);
  
  // Initialize and connect
  if (!meshTransport->init()) {
    Serial.println("ERROR: BLE initialization failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  if (!meshTransport->connect()) {
    Serial.println("MeshCore connection failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Start session
  if (!meshProtocol->startSession("ESP32-Uptime")) {
    Serial.println("MeshCore session start failed");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  // Find the configured channel
  uint8_t channelIdx;
  if (!meshProtocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
    Serial.println("Channel not found");
    disconnectMeshCore();  // Clean up allocated objects
    return;
  }
  
  Serial.printf("MeshCore ready on channel %d\n", channelIdx);
}

bool ensureAuthenticated(AsyncWebServerRequest* request) {
  if (strlen(WEB_AUTH_USERNAME) == 0 || strlen(WEB_AUTH_PASSWORD) == 0) {
    return true;
  }

  if (request->authenticate(WEB_AUTH_USERNAME, WEB_AUTH_PASSWORD)) {
    return true;
  }

  request->requestAuthentication();
  return false;
}

void initFileSystem() {
  // First attempt: try to mount without formatting
  if (LittleFS.begin(false)) {
    Serial.println("LittleFS mounted successfully");
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

  // If mount fails, explicitly format the filesystem first
  // This handles severely corrupted filesystems better than begin(true)
  if (!LittleFS.format()) {
    Serial.println("LittleFS format failed! Check partition table and flash configuration.");
    return;
  }

  Serial.println("LittleFS formatted successfully");

  // Now try to mount the freshly formatted filesystem
  if (!LittleFS.begin(false)) {
    Serial.println("Critical: Failed to mount LittleFS after successful format!");
    return;
  }

  Serial.println("LittleFS mounted successfully after format");
}

void disconnectMeshCore() {
  // Clean up the layered protocol stack
  if (meshProtocol != nullptr) {
    delete meshProtocol;
    meshProtocol = nullptr;
  }
  
  if (meshCodec != nullptr) {
    delete meshCodec;
    meshCodec = nullptr;
  }
  
  if (meshTransport != nullptr) {
    meshTransport->disconnect();
    meshTransport->deinit();
    delete meshTransport;
    meshTransport = nullptr;
  }
  
  Serial.println("MeshCore disconnected and deinitialized");
}

void disconnectWiFi() {
  Serial.println("Disconnecting WiFi for BLE operation...");
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
  delay(100); // Allow WiFi to fully shut down
  Serial.println("WiFi disconnected");
}

void reconnectWiFi() {
  Serial.println("Reconnecting WiFi after BLE operation...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi reconnected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to reconnect to WiFi!");
  }
}

void initWebServer() {

