bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      JsonDocument response;
      response["success"] = true;
      response["imported"] = importedCount;
      response["skipped"] = skippedCount;

      String responseStr;
      serializeJson(response, responseStr);
      request->send(200, "application/json", responseStr);
    }
  );

  server.begin();
  Serial.println("Web server started");
}

String generateServiceId() {
  return String(millis()) + String(random(1000, 9999));
}

void checkServices() {
  unsigned long currentTime = millis();

  for (int i = 0; i < serviceCount; i++) {
    // Check if it's time to check this service
    if (currentTime - services[i].lastCheck < services[i].checkInterval * 1000) {
      continue;
    }

    bool firstCheck = services[i].lastCheck == 0;
    services[i].lastCheck = currentTime;
    bool wasUp = services[i].isUp;

    // Perform the actual check
    bool checkResult = false;
    switch (services[i].type) {
      case TYPE_HTTP_GET:
        checkResult = checkHttpGet(services[i]);
        break;
      case TYPE_PING:
        checkResult = checkPing(services[i]);
        break;
      case TYPE_SNMP_GET:
        checkResult = checkSnmpGet(services[i]);
        break;
    }

    // Update consecutive counters based on check result
    if (checkResult) {
      services[i].consecutivePasses++;
      services[i].consecutiveFails = 0;
      services[i].lastUptime = currentTime;
      services[i].lastError = "";
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on success
    } else {
      services[i].consecutiveFails++;
      services[i].consecutivePasses = 0;
    }

    // Determine new state based on thresholds
    if (!services[i].isUp && services[i].consecutivePasses >= services[i].passThreshold) {
      // Service has passed enough times to be considered UP
      services[i].isUp = true;
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on recovery
    } else if (services[i].isUp && services[i].consecutiveFails >= services[i].failThreshold) {
      // Service has failed enough times to be considered DOWN
      services[i].isUp = false;
    }

    // Log and notify on state changes
    if (wasUp != services[i].isUp) {
      Serial.printf("Service '%s' is now %s (after %d consecutive %s)\n",
        services[i].name.c_str(),
        services[i].isUp ? "UP" : "DOWN",
        services[i].isUp ? services[i].consecutivePasses : services[i].consecutiveFails,
        services[i].isUp ? "passes" : "fails");

      if (!services[i].isUp) {
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after initial alert
      } else if (!firstCheck) {
        sendOnlineNotification(services[i]);
      }
    } else if (!services[i].isUp && !checkResult && services[i].rearmCount > 0) {
      // Service is still DOWN and check failed - handle re-arm logic
      services[i].failedChecksSinceAlert++;
      if (services[i].failedChecksSinceAlert >= services[i].rearmCount) {
        Serial.printf("Service '%s' still DOWN - re-arming alert after %d failed checks\n",
          services[i].name.c_str(), services[i].failedChecksSinceAlert);
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after re-arm alert
      }
    }
  }
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + service.path;

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        isUp = payload.indexOf(service.expectedResponse) >= 0;
        if (!isUp) {
          service.lastError = "Response mismatch";
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

// Helper function to compare SNMP values based on operator
bool compareSnmpValue(const String& actualValue, SnmpCompareOp op, const String& expectedValue) {
  // Try numeric comparison first
  bool actualIsNumeric = true;
  bool expectedIsNumeric = true;
  float actualNum = 0;
  float expectedNum = 0;
  
  // Check if actual value is numeric
  if (actualValue.length() > 0) {
    char* endPtr;
    actualNum = strtof(actualValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      actualIsNumeric = false;
    }
  } else {
    actualIsNumeric = false;
  }
  
  // Check if expected value is numeric
  if (expectedValue.length() > 0) {
    char* endPtr;
    expectedNum = strtof(expectedValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      expectedIsNumeric = false;
    }
  } else {
    expectedIsNumeric = false;
  }
  
  // Use numeric comparison if both are numeric
  if (actualIsNumeric && expectedIsNumeric) {
    switch (op) {
      case SNMP_OP_EQ: return actualNum == expectedNum;
      case SNMP_OP_NE: return actualNum != expectedNum;
      case SNMP_OP_LT: return actualNum < expectedNum;
      case SNMP_OP_LE: return actualNum <= expectedNum;
      case SNMP_OP_GT: return actualNum > expectedNum;
      case SNMP_OP_GE: return actualNum >= expectedNum;
    }
  }
  
  // Fall back to string comparison for non-numeric values
  int cmp = actualValue.compareTo(expectedValue);
  switch (op) {
    case SNMP_OP_EQ: return cmp == 0;
    case SNMP_OP_NE: return cmp != 0;
    case SNMP_OP_LT: return cmp < 0;
    case SNMP_OP_LE: return cmp <= 0;
    case SNMP_OP_GT: return cmp > 0;
    case SNMP_OP_GE: return cmp >= 0;
  }
  
  return false;
}

bool checkSnmpGet(Service& service) {
  // Resolve hostname to IP
  IPAddress targetIP;
  if (!WiFi.hostByName(service.host.c_str(), targetIP)) {
    service.lastError = "DNS resolution failed";
    return false;
  }
  
  // Create SNMP objects for this request
  WiFiUDP udp;
  SNMPManager snmpManager(service.snmpCommunity.c_str());
  SNMPGet snmpRequest(service.snmpCommunity.c_str(), 1);  // SNMP version 2c (0=v1, 1=v2c)
  
  // Initialize SNMP manager
  snmpManager.setUDP(&udp);
  snmpManager.begin();
  
  // Use local variables to avoid thread safety issues
  // Use special marker values to detect if they were updated
  char stringValue[256];
  char* stringValuePtr = stringValue;
  stringValue[0] = '\0';
  
