bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  String title = "ESP32 Uptime Monitor Started";
  String message = "Device has booted and is now monitoring services.";
  message += " IP: " + WiFi.localIP().toString();

  if (isNtfyConfigured()) {
    sendNtfyNotification(title, message, "rocket,monitor");
  }

  if (isDiscordConfigured()) {
    sendDiscordNotification(title, message);
  }

  if (isSmtpConfigured()) {
    sendSmtpNotification(title, message);
  }

  if (isMeshCoreConfigured()) {
    sendMeshCoreNotification(title, message);
  }

  Serial.println("Boot notification sent");
}

// Notification functions that return success status for queue management

bool sendNtfyNotificationWithStatus(const String& title, const String& message, const String& tags) {
  HTTPClient http;
  String url = String(NTFY_SERVER) + "/" + NTFY_TOPIC;

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }
  http.addHeader("Title", title);
  http.addHeader("Tags", tags);
  http.addHeader("Content-Type", "text/plain");

  if (strlen(NTFY_ACCESS_TOKEN) > 0) {
    http.addHeader("Authorization", "Bearer " + String(NTFY_ACCESS_TOKEN));
  } else if (strlen(NTFY_USERNAME) > 0) {
    http.setAuthorization(NTFY_USERNAME, NTFY_PASSWORD);
  }

  int httpCode = http.POST(message);
  http.end();

  if (httpCode >= 200 && httpCode < 300) {
    Serial.printf("ntfy notification sent: %d\n", httpCode);
    return true;
  } else {
    Serial.printf("Failed to send ntfy notification: %d\n", httpCode);
    return false;
  }
}

bool sendDiscordNotificationWithStatus(const String& title, const String& message) {
  HTTPClient http;
  String url = String(DISCORD_WEBHOOK_URL);

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }

  http.addHeader("Content-Type", "application/json");

  JsonDocument doc;
  doc["content"] = "**" + title + "**\n" + message;

  String payload;
  serializeJson(doc, payload);

  int httpCode = http.POST(payload);
  http.end();

  if (httpCode >= 200 && httpCode < 300) {
    Serial.printf("Discord notification sent: %d\n", httpCode);
    return true;
  } else {
    Serial.printf("Failed to send Discord notification: %d\n", httpCode);
    return false;
  }
}

bool sendSmtpNotificationWithStatus(const String& title, const String& message) {
  WiFiClient plainClient;
  WiFiClientSecure secureClient;
  WiFiClient* client = &plainClient;

  if (SMTP_USE_TLS) {
    secureClient.setInsecure();
    client = &secureClient;
  }

  if (!client->connect(SMTP_SERVER, SMTP_PORT)) {
    Serial.println("Failed to connect to SMTP server");
    return false;
  }

  if (!readSmtpResponse(*client, 220)) { client->stop(); return false; }
  if (!sendSmtpCommand(*client, "EHLO esp32-monitor", 250)) { client->stop(); return false; }

  if (strlen(SMTP_USERNAME) > 0) {
    if (!sendSmtpCommand(*client, "AUTH LOGIN", 334)) { client->stop(); return false; }
    if (!sendSmtpCommand(*client, base64Encode(SMTP_USERNAME), 334)) { client->stop(); return false; }
    if (!sendSmtpCommand(*client, base64Encode(SMTP_PASSWORD), 235)) { client->stop(); return false; }
  }

  if (!sendSmtpCommand(*client, "MAIL FROM:<" + String(SMTP_FROM_ADDRESS) + ">", 250)) { client->stop(); return false; }

  String recipients = String(SMTP_TO_ADDRESS);
  recipients.replace(" ", "");
  int start = 0;
  while (start < (int)recipients.length()) {
    int commaIndex = recipients.indexOf(',', start);
    if (commaIndex == -1) commaIndex = recipients.length();
    String address = recipients.substring(start, commaIndex);
    if (address.length() > 0) {
      if (!sendSmtpCommand(*client, "RCPT TO:<" + address + ">", 250)) { client->stop(); return false; }
    }
    start = commaIndex + 1;
  }

  if (!sendSmtpCommand(*client, "DATA", 354)) { client->stop(); return false; }

  client->printf("From: <%s>\r\n", SMTP_FROM_ADDRESS);
  client->printf("To: %s\r\n", SMTP_TO_ADDRESS);
  client->printf("Subject: %s\r\n", title.c_str());
  client->println("Content-Type: text/plain; charset=\"UTF-8\"\r\n");
  client->println(message);
  client->println(".");

  if (!readSmtpResponse(*client, 250)) { client->stop(); return false; }
  sendSmtpCommand(*client, "QUIT", 221);
  client->stop();

  Serial.println("SMTP notification sent");
  return true;
}

bool sendMeshCoreNotificationWithStatus(const String& title, const String& message) {
  // ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on demand
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport transport(config);
  FrameCodec codec(transport);
  CompanionProtocol protocol(transport, codec);
  
  bool success = false;
  
  // Initialize and connect
  if (transport.init()) {
    if (transport.connect()) {
      // Start session
      if (protocol.startSession("ESP32-Uptime")) {
        // Find the configured channel
        uint8_t channelIdx;
        if (protocol.findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
          // Build the message: combine title and message
          String fullMessage = title + ": " + message;
          
          // Send using the protocol layer
          if (protocol.sendTextMessageToChannel(channelIdx, fullMessage)) {
            Serial.println("MeshCore notification sent successfully");
            success = true;
          } else {
            Serial.printf("MeshCore notification failed: send error - %s\n", protocol.getLastError().c_str());
          }
        } else {
          Serial.printf("MeshCore notification skipped: channel not found - %s\n", protocol.getLastError().c_str());
        }
      } else {
        Serial.printf("MeshCore notification skipped: session start failed - %s\n", protocol.getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore notification skipped: not connected - %s\n", transport.getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore notification skipped: BLE init failed - %s\n", transport.getLastError().c_str());
  }
  
