bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // Create the layered protocol stack on demand
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport transport(config);
  FrameCodec codec(transport);
  CompanionProtocol protocol(transport, codec);
  
  bool sessionReady = false;
  uint8_t channelIdx = 0;
  
  // Initialize, connect and prepare session once
  if (transport.init()) {
    if (transport.connect()) {
      if (protocol.startSession("ESP32-Uptime")) {
        if (protocol.findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
          sessionReady = true;
          Serial.println("MeshCore session ready, sending queued messages...");
        } else {
          Serial.printf("MeshCore batch: channel not found - %s\n", protocol.getLastError().c_str());
        }
      } else {
        Serial.printf("MeshCore batch: session start failed - %s\n", protocol.getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore batch: not connected - %s\n", transport.getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore batch: BLE init failed - %s\n", transport.getLastError().c_str());
  }
  
  // Send all pending MeshCore notifications in this single session
  if (sessionReady) {
    for (int i = 0; i < queuedNotificationCount; i++) {
      QueuedNotification& notification = notificationQueue[i];
      if (notification.meshPending) {
        String fullMessage = notification.title + ": " + notification.message;
        if (protocol.sendTextMessageToChannel(channelIdx, fullMessage)) {
          notification.meshPending = false;
          Serial.printf("Retry: MeshCore notification sent for %s\n", notification.serviceId.c_str());
        } else {
          Serial.printf("MeshCore send failed for %s: %s\n", 
                        notification.serviceId.c_str(), protocol.getLastError().c_str());
        }
        // Small delay between messages to avoid overwhelming the receiver
        delay(100);
      }
    }
  }
  
  // Disconnect BLE and deinitialize to free resources
  transport.disconnect();
  transport.deinit();
  
  // Reconnect WiFi
  reconnectWiFi();
  
  // Resume monitoring
  bleOperationInProgress = false;
  monitoringPaused = false;
  
  Serial.println("MeshCore batch operation complete");
  
  // Clean up any notifications that have all channels sent
  for (int i = 0; i < queuedNotificationCount; i++) {
    QueuedNotification& notification = notificationQueue[i];
    if (!notification.ntfyPending && !notification.discordPending && 
        !notification.smtpPending && !notification.meshPending) {
      Serial.printf("All notifications sent for %s, removing from queue\n", notification.serviceId.c_str());
      removeQueuedNotification(i);
      i--;
    }
  }
}

void saveServices() {
  File file = LittleFS.open("/services.json", "w");
  if (!file) {
    Serial.println("Failed to open services.json for writing");
    return;
  }

  JsonDocument doc;
  JsonArray array = doc["services"].to<JsonArray>();

  for (int i = 0; i < serviceCount; i++) {
    JsonObject obj = array.add<JsonObject>();
    obj["id"] = services[i].id;
    obj["name"] = services[i].name;
    obj["type"] = (int)services[i].type;
    obj["host"] = services[i].host;
    obj["port"] = services[i].port;
    obj["path"] = services[i].path;
    obj["expectedResponse"] = services[i].expectedResponse;
    obj["checkInterval"] = services[i].checkInterval;
    obj["passThreshold"] = services[i].passThreshold;
    obj["failThreshold"] = services[i].failThreshold;
    obj["rearmCount"] = services[i].rearmCount;
    // SNMP-specific fields
    obj["snmpOid"] = services[i].snmpOid;
    obj["snmpCommunity"] = services[i].snmpCommunity;
    obj["snmpCompareOp"] = (int)services[i].snmpCompareOp;
    obj["snmpExpectedValue"] = services[i].snmpExpectedValue;
  }

  if (serializeJson(doc, file) == 0) {
    Serial.println("Failed to serialize services.json");
  }
  file.close();
  Serial.println("Services saved");
}

void loadServices() {
  File file = LittleFS.open("/services.json", "r");
  if (!file) {
    Serial.println("No services.json found, starting fresh");
    return;
  }

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();

  if (error) {
    Serial.println("Failed to parse services.json");
    return;
  }

  JsonArray array = doc["services"];
  serviceCount = 0;

  for (JsonObject obj : array) {
    if (serviceCount >= MAX_SERVICES) break;

    services[serviceCount].id = obj["id"].as<String>();
    services[serviceCount].name = obj["name"].as<String>();
    services[serviceCount].type = (ServiceType)obj["type"].as<int>();
    services[serviceCount].host = obj["host"].as<String>();
    services[serviceCount].port = obj["port"];
    services[serviceCount].path = obj["path"].as<String>();
    services[serviceCount].expectedResponse = obj["expectedResponse"].as<String>();
    services[serviceCount].checkInterval = obj["checkInterval"];
    services[serviceCount].passThreshold = obj["passThreshold"] | 1;
    services[serviceCount].failThreshold = obj["failThreshold"] | 1;
    services[serviceCount].rearmCount = obj["rearmCount"] | 0;
    // SNMP-specific fields
    services[serviceCount].snmpOid = obj["snmpOid"] | "";
    services[serviceCount].snmpCommunity = obj["snmpCommunity"] | "public";
    services[serviceCount].snmpCompareOp = (SnmpCompareOp)(obj["snmpCompareOp"].as<int>());
    services[serviceCount].snmpExpectedValue = obj["snmpExpectedValue"] | "";
    services[serviceCount].consecutivePasses = 0;
    services[serviceCount].consecutiveFails = 0;
    services[serviceCount].failedChecksSinceAlert = 0;
    services[serviceCount].isUp = false;
    services[serviceCount].lastCheck = 0;
    services[serviceCount].lastUptime = 0;
    services[serviceCount].lastError = "";
    services[serviceCount].secondsSinceLastCheck = -1;

    serviceCount++;
  }

  Serial.printf("Loaded %d services\n", serviceCount);
}

String getServiceTypeString(ServiceType type) {
  switch (type) {
    case TYPE_HTTP_GET: return "http_get";
    case TYPE_PING: return "ping";
    case TYPE_SNMP_GET: return "snmp_get";
    default: return "unknown";
  }
}

