bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
                <div class="form-row">
                    <div class="form-group">
                        <label for="serviceType">Service Type</label>
                        <select id="serviceType" required>
                            <option value="http_get">HTTP GET</option>
                            <option value="ping">Ping</option>
                            <option value="snmp_get">SNMP GET</option>
                        </select>
                    </div>

                    <div class="form-group">
                        <label for="serviceHost">Host / IP Address</label>
                        <input type="text" id="serviceHost" required placeholder="192.168.1.100">
                    </div>
                </div>

                <div class="form-row">
                    <div class="form-group">
                        <label for="servicePort">Port</label>
                        <input type="number" id="servicePort" value="80" required>
                    </div>

                    <div class="form-group">
                        <label for="checkInterval">Check Interval (seconds)</label>
                        <input type="number" id="checkInterval" value="60" required min="10">
                    </div>
                </div>

                <div class="form-row">
                    <div class="form-group">
                        <label for="failThreshold">Fail Threshold</label>
                        <input type="number" id="failThreshold" value="1" required min="1" title="Number of consecutive failures before marking as DOWN">
                    </div>

                    <div class="form-group">
                        <label for="passThreshold">Pass Threshold</label>
                        <input type="number" id="passThreshold" value="1" required min="1" title="Number of consecutive successes before marking as UP">
                    </div>
                </div>

                <div class="form-group">
                    <label for="rearmCount">Re-arm Alert Count (0 = disabled)</label>
                    <input type="number" id="rearmCount" value="0" required min="0" title="Number of failed checks before re-alerting while service is DOWN. Set to 0 to disable.">
                </div>

                <div class="form-group" id="pathGroup">
                    <label for="servicePath">Path</label>
                    <input type="text" id="servicePath" value="/" placeholder="/">
                </div>

                <div class="form-group" id="responseGroup">
                    <label for="expectedResponse">Expected Response (* for any)</label>
                    <input type="text" id="expectedResponse" value="*" placeholder="*">
                </div>

                <div class="form-group hidden" id="snmpOidGroup">
                    <label for="snmpOid">SNMP OID</label>
                    <input type="text" id="snmpOid" value="" placeholder="1.3.6.1.2.1.1.1.0">
                </div>

                <div class="form-group hidden" id="snmpCommunityGroup">
                    <label for="snmpCommunity">SNMP Community String</label>
                    <input type="text" id="snmpCommunity" value="public" placeholder="public">
                </div>

                <div class="form-row hidden" id="snmpCompareGroup">
                    <div class="form-group">
                        <label for="snmpCompareOp">Comparison Operator</label>
                        <select id="snmpCompareOp">
                            <option value="=">=  (Equal)</option>
                            <option value="<>"><>  (Not Equal)</option>
                            <option value="<"><  (Less Than)</option>
                            <option value="<="><= (Less or Equal)</option>
                            <option value=">">  (Greater Than)</option>
                            <option value=">=">>= (Greater or Equal)</option>
                        </select>
                    </div>

                    <div class="form-group">
                        <label for="snmpExpectedValue">Expected Value</label>
                        <input type="text" id="snmpExpectedValue" value="" placeholder="Expected value">
                    </div>
                </div>

                <button type="submit" class="btn btn-primary">Add Service</button>
            </form>
        </div>

        <h2 style="color: white; margin-bottom: 20px; font-size: 1.5em;">Monitored Services</h2>
        <div id="servicesContainer" class="services-grid"></div>
        <div id="emptyState" class="empty-state hidden">
            <h3>No services yet</h3>
            <p>Add your first service using the form above</p>
        </div>
    </div>

    <script>
        let services = [];

        // Update form fields based on service type
        document.getElementById('serviceType').addEventListener('change', function() {
            const type = this.value;
            const pathGroup = document.getElementById('pathGroup');
            const responseGroup = document.getElementById('responseGroup');
            const portInput = document.getElementById('servicePort');
            const snmpOidGroup = document.getElementById('snmpOidGroup');
            const snmpCommunityGroup = document.getElementById('snmpCommunityGroup');
            const snmpCompareGroup = document.getElementById('snmpCompareGroup');

            if (type === 'ping') {
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');
            } else if (type === 'snmp_get') {
                pathGroup.classList.add('hidden');
                responseGroup.classList.add('hidden');
                snmpOidGroup.classList.remove('hidden');
                snmpCommunityGroup.classList.remove('hidden');
                snmpCompareGroup.classList.remove('hidden');
                portInput.value = 161;
            } else {
                pathGroup.classList.remove('hidden');
                snmpOidGroup.classList.add('hidden');
                snmpCommunityGroup.classList.add('hidden');
                snmpCompareGroup.classList.add('hidden');

